note/drawio/converted/mermaid/260420-input-conditioning.mmd
flowchart LR
  n_Ufit_6sDCXz0J2qk3ZfJ_1["o_sw0"]
  n_Ufit_6sDCXz0J2qk3ZfJ_2["o_sw15"]
  n_k6zkxdQElb2d_6jz5bX1_1["BtnL"]
  n_k6zkxdQElb2d_6jz5bX1_11["SW[0]"]
  n_k6zkxdQElb2d_6jz5bX1_12["SW[15]"]
  n_k6zkxdQElb2d_6jz5bX1_14["debouncer_L"]
  n_k6zkxdQElb2d_6jz5bX1_16["debouncer_U"]
  n_k6zkxdQElb2d_6jz5bX1_17["debouncer_D"]
  n_k6zkxdQElb2d_6jz5bX1_18["debouncer_R"]
  n_k6zkxdQElb2d_6jz5bX1_2["BtnU"]
  n_k6zkxdQElb2d_6jz5bX1_25["o_btnL"]
  n_k6zkxdQElb2d_6jz5bX1_26["o_btn__hold"]
  n_k6zkxdQElb2d_6jz5bX1_3["BtnD"]
  n_k6zkxdQElb2d_6jz5bX1_32["o_btn_"]
  n_k6zkxdQElb2d_6jz5bX1_34["o_btn__hold"]
  n_k6zkxdQElb2d_6jz5bX1_36["o_btn_"]
  n_k6zkxdQElb2d_6jz5bX1_38["o_btn__hold"]
  n_k6zkxdQElb2d_6jz5bX1_4["BtnR"]
  n_k6zkxdQElb2d_6jz5bX1_40["o_btn_"]
  n_k6zkxdQElb2d_6jz5bX1_42["o_btn__hold"]
  n_k6zkxdQElb2d_6jz5bX1_9["node_5bX1-9"]
  n_k6zkxdQElb2d_6jz5bX1_1 --> n_k6zkxdQElb2d_6jz5bX1_14
  n_k6zkxdQElb2d_6jz5bX1_2 --> n_k6zkxdQElb2d_6jz5bX1_16
